Series

1D ndarray with an axis label

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.0.5'

In [3]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [4]:
type(population_dict)

dict

In [5]:
population = pd.Series(population_dict)
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [6]:
type(population)

pandas.core.series.Series

In [7]:
population['California']

38956785

In [8]:
population[0]

38956785

In [9]:
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [10]:
population['California':'Illinois']

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [11]:
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [12]:
pd.Series( [2,4,6] , index=[100,200,300] )

100    2
200    4
300    6
dtype: int64

In [13]:
pd.Series( 5 )

0    5
dtype: int64

In [14]:
pd.Series( 5 , index=[100,200,300] )

100    5
200    5
300    5
dtype: int64

In [15]:
pd.Series( {2:'a' ,  1:'b', 3:'c'} )

2    a
1    b
3    c
dtype: object

In [16]:
pd.Series( {2:'a' ,  1:'b', 3:'c'}, index=[3,2] )

3    c
2    a
dtype: object

In [17]:
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [18]:
population.shape # Series

(5,)

In [19]:
type(population)

pandas.core.series.Series

In [20]:
df = pd.DataFrame(population)
df

                   0
California  38956785
Texas       26441568
New York    19555647
Florida     12364569
Illinois    12882135

In [21]:
df.shape # DataFrame

(5, 1)

In [22]:
df = pd.DataFrame(population, columns=['Population'])
df

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [23]:
data = [ {'a':i, 'b':2*i} for i in range(3) ]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [24]:
df = pd.DataFrame(data)
df

   a  b
0  0  0
1  1  2
2  2  4

In [25]:
df = pd.DataFrame(data, index=['X','Y','Z'])
df

   a  b
X  0  0
Y  1  2
Z  2  4

In [26]:
df = pd.DataFrame(data, index=['X','Y','Z'])
df

   a  b
X  0  0
Y  1  2
Z  2  4

In [27]:
df.columns

Index(['a', 'b'], dtype='object')

In [28]:
df.columns=['A','B']
df

   A  B
X  0  0
Y  1  2
Z  2  4

In [29]:
df.index = ['m','n','o']
df

   A  B
m  0  0
n  1  2
o  2  4

In [30]:
pd.DataFrame( [ {'a':1,'b':2} , {'b':3,'c':4} ] )

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [31]:
import numpy as np
pd.DataFrame(np.random.rand(3,2), columns=['Darshan','Ingle'], index=['a','b','c'])

    Darshan     Ingle
a  0.114812  0.415526
b  0.921928  0.581316
c  0.893087  0.912708

__Indexers: loc and iloc__

In [32]:
data = pd.Series(['a','b','c'] , index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [33]:
# explicit index when indexing
data[1]

'a'

In [34]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [35]:
data

1    a
3    b
5    c
dtype: object

In [36]:
data.loc[1]

'a'

In [37]:
data.iloc[1]

'b'

In [38]:
data.loc[1:3]

1    a
3    b
dtype: object

In [39]:
data.iloc[1:3] # SI to (EI-1)

3    b
5    c
dtype: object

__Data Retrieval:__

>1. List of Dictionaries

>2. csv files

>3. Databases

In [40]:
# List of Dictionaries

d = [ {'city':'Delhi','data':1000}, {'city':'Mumbai','data':2000}, 
     {'city':'Bangalore','data':1500} ]
pd.DataFrame(d)

        city  data
0      Delhi  1000
1     Mumbai  2000
2  Bangalore  1500

In [41]:
# csv files

df = pd.read_csv('student_records.csv')
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [49]:
df = pd.read_csv('./datasets_n_images/datasets_module_1/student_records.csv')
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [44]:
df.head() # 5 rows

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [45]:
df.head(3)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
2  David            F        N             10            17        No

In [46]:
df.head(6)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes

In [47]:
df.tail() # last 5 rows

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [48]:
df.tail(2)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

# Databases

import cx_Oracle

server = 'xxxxxxxx' # Address of the database server
user = 'xxxxxx' # the username for the database server
password = 'xxxxxx' # password for the database server

conn = cxOracle.connect( server=server, user=user, password=password )

query = 'select * from some_table'

df = pd.read_sql( query , conn )

In [50]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [53]:
ser = df.ProjectScore
print(ser)
print(type(ser))
print(ser.shape)

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64
<class 'pandas.core.series.Series'>
(8,)

In [55]:
df['ProjectScore']

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64

In [56]:
df.shape

(8, 6)

In [58]:
list(df.columns)

['Name',
 'OverallGrade',
 'Obedient',
 'ResearchScore',
 'ProjectScore',
 'Recommend']

In [59]:
# Summary of the numeric columns
df.describe()

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [62]:
df['ResearchScore'].quantile(0.5)

75.0

In [64]:
df['ResearchScore'].quantile(0.9)

90.6

In [65]:
df['ResearchScore'].mean()

63.375

In [66]:
df['ResearchScore'].count()

8

In [68]:
df.columns # All cols

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [70]:
# Numeric cols
df.describe().columns

Index(['ResearchScore', 'ProjectScore'], dtype='object')

In [82]:
x = df.drop('Name',axis=1)
x

  OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0            A        Y             90            85       Yes
1            C        N             85            51       Yes
2            F        N             10            17        No
3            B        Y             75            71        No
4            E        N             20            30        No
5            A        Y             92            79       Yes
6            B        Y             60            59        No
7            C        Y             75            33        No

In [86]:
# Categorical cols
list(set(x.columns) - set(x.describe().columns))

['Recommend', 'Obedient', 'OverallGrade']

In [92]:
cat_col = list(set(x.columns) - set(x.describe().columns))
cat_col

['Recommend', 'Obedient', 'OverallGrade']

In [93]:
x[cat_col]

  Recommend Obedient OverallGrade
0       Yes        Y            A
1       Yes        N            C
2        No        N            F
3        No        Y            B
4        No        N            E
5       Yes        Y            A
6        No        Y            B
7        No        Y            C

In [87]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [94]:
# Find the students who have got the research score >=80

df[df['ResearchScore'] >=80]

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
5  Simon            A        Y             92            79       Yes

In [105]:
# Find the students who have got the research score >=80

df[df['ResearchScore'] >=80]['Name']

0    Henry
1     John
5    Simon
Name: Name, dtype: object

In [107]:
df[df['ResearchScore'] >=80]['Name'].shape[0]

3

In [108]:
df[df['ResearchScore'] >=80]['Name'].shape[0]+47

50

In [97]:
# Find the students who have got the research score >=80

df.where(df.ResearchScore >= 80)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y           90.0          85.0       Yes
1   John            C        N           85.0          51.0       Yes
2    NaN          NaN      NaN            NaN           NaN       NaN
3    NaN          NaN      NaN            NaN           NaN       NaN
4    NaN          NaN      NaN            NaN           NaN       NaN
5  Simon            A        Y           92.0          79.0       Yes
6    NaN          NaN      NaN            NaN           NaN       NaN
7    NaN          NaN      NaN            NaN           NaN       NaN

In [98]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [100]:
df['OverallGrade'].unique()

array(['A', 'C', 'F', 'B', 'E'], dtype=object)

In [109]:
df['OverallGrade'].value_counts()

A    2
C    2
B    2
E    1
F    1
Name: OverallGrade, dtype: int64

In [110]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [112]:
nparray = df.values
print(nparray)
print(type(nparray))
print(nparray.shape)

[['Henry' 'A' 'Y' 90 85 'Yes']
 ['John' 'C' 'N' 85 51 'Yes']
 ['David' 'F' 'N' 10 17 'No']
 ['Holmes' 'B' 'Y' 75 71 'No']
 ['Marvin' 'E' 'N' 20 30 'No']
 ['Simon' 'A' 'Y' 92 79 'Yes']
 ['Robert' 'B' 'Y' 60 59 'No']
 ['Trent' 'C' 'Y' 75 33 'No']]
<class 'numpy.ndarray'>
(8, 6)

In [113]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [117]:
df['ResearchScore']

0    90
1    85
2    10
3    75
4    20
5    92
6    60
7    75
Name: ResearchScore, dtype: int64

In [118]:
df['ResearchScore'].sum()

507

In [120]:
col_num = df.describe().columns
x = df[col_num]
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [122]:
x.sum()

ResearchScore    507
ProjectScore     425
dtype: int64

In [124]:
x.sum(axis=0)

ResearchScore    507
ProjectScore     425
dtype: int64

In [125]:
x.sum(axis=1)

0    175
1    136
2     27
3    146
4     50
5    171
6    119
7    108
dtype: int64

In [126]:
x.mean(axis=0)

ResearchScore    63.375
ProjectScore     53.125
dtype: float64

In [127]:
x.mean(axis=1)

0    87.5
1    68.0
2    13.5
3    73.0
4    25.0
5    85.5
6    59.5
7    54.0
dtype: float64

In [128]:
x.count(axis=0)

ResearchScore    8
ProjectScore     8
dtype: int64

In [129]:
x.count(axis=1)

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
dtype: int64

In [130]:
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [133]:
x['TOTAL'] = x['ResearchScore'] + x['ProjectScore']
x

<ipython-input-133-1c7f0f5b8461>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['TOTAL'] = x['ResearchScore'] + x['ProjectScore']

   ResearchScore  ProjectScore  TOTAL
0             90            85    175
1             85            51    136
2             10            17     27
3             75            71    146
4             20            30     50
5             92            79    171
6             60            59    119
7             75            33    108

In [134]:
x['TIMEPASS'] = 9999
x

<ipython-input-134-881f1365b0f6>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x['TIMEPASS'] = 9999

   ResearchScore  ProjectScore  TOTAL  TIMEPASS
0             90            85    175      9999
1             85            51    136      9999
2             10            17     27      9999
3             75            71    146      9999
4             20            30     50      9999
5             92            79    171      9999
6             60            59    119      9999
7             75            33    108      9999